/* 3.2 Використання поліморфізму для зворотного виклику
 * Створити клас для розв'язання завдання 1.2 шостої лабораторної роботи попереднього семестру.
 * Клас повинен містити принаймні два методи – функцію, яка повертає значення відповідно до індивідуального завдання,
 * а також суто віртуальну функцію, яка викликається з попередньої та визначає ліву частину рівняння
 * або функцію для дослідження (відповідно до завдання).
 * Клас розташувати в окремому заголовному файлі.
 * У відповідному файлі реалізації здійснити визначення однієї з двох функцій класу.
 * В іншій одиниці трансляції створити похідний клас із визначенням конкретної функції, яка підлягає дослідженню.
 * У функції main() створити об'єкт похідного класу та здійснити виконання індивідуального завдання.
 * Примітка: Для обчислення першої (другої) похідної слід додати окремі функції-члени базового класу.
 *
 * Умова індивідуального завдання 1.2 лабораторної рооти № 6 (семестр 1):
 * Написати програму, яка реалізує перебір значень на визначеному інтервалі з певним кроком з метою пошуку
 * деякого значення відповідно до індивідуального завдання, наведеного в таблиці. Необхідне значення може бути
 * знайдено шляхом перевірки проміжних значень функції (або першої / другої похідної).
 * Слід використати вказівник на функцію, для якого визначити typedef.
 * Сирцевий код повинен бути розділений на дві одиниці трансляції.
 * Перша одиниця трансляції буде представлена заголовним файлом і файлом реалізації. Визначення typedef,
 * а також прототип функції пошуку потрібного значення, повинні бути розташовані в заголовному файлі.
 * Визначення цієї функції слід здійснити у файлі реалізації. Функція для перевірки працездатності програми,
 * а також функція main(), повинні бути розташовані в іншій одиниці трансляції.
 * Номер варіанту (номер студента у списку): 25.
 * Правило пошуку: Найменший корінь першої похідної.
 * Слід перевірити працездатність програми не менш ніж на двох довільних функціях.
 * Одна з функцій може бути стандартною.
 * Корінь – це точка, в якій функція повертає нуль.
 * Примітка: Для обчислення першої похідної y(x) можна використати таку формулу:
 * y'(x) = (y(x + Δx) - y(x)) / Δx, де Δx - деяке невеличке значення, наприклад 0.0000001. */

/* Commands to run:
g++ -std=c++11 -Wall -Wextra -Werror -Wpedantic source.cpp main.cpp -o task3_2
./task3_2
*/

#include "header.h"

//Class for calculating derivatives for the pow of two function
class powFunction : public AbstractDerivative {
public:
    //Overridden pure virtual function of the base class
    virtual double someFunction(double x) override {
        return pow(x, 2); //The derivative of pow of two function is 2x
    }
};

int main() {
    powFunction powFunction;
    std::cout << "The pow of two function:\n";
    std::cout << "The square root of the minimum value of the first derivative on the interval [1; 6] (step = 2): "
    << powFunction.findSqrtMinDerivative(1, 6, 2) << "\n";

    try {
        std::cout << "The square root of the minimum value of the first derivative on the interval [-5; 8] (step = 1): "
                  << powFunction.findSqrtMinDerivative(-5, 8, 1) << "\n";
    }
    catch (const char* string) {
        std::cout << string;
    }

    return 0;
}
